{
  "name": "iOS",
  "description": "The mobile operating system that runs on the iPhone, iPad, iPod touch, and Apple TV.",
  "steps": [
    {
      "name": "Critical Learning",
      "resources": [
        {
          "title": "Read Learning Objective-C: A Primer",
          "uri": "http://developer.apple.com/library/mac/#referencelibrary/GettingStarted/Learning_Objective-C_A_Primer/_index.html"
        },
        {
          "title": "Read Learn Objective-C on the Mac",
          "uri": "http://amzn.to/learn-objective-c-mac"
        },
        {
          "title": "Read Beginning iOS 5 Development: Exploring the iOS SDK",
          "uri": "http://amzn.to/beginning-ios5"
        },
        {
          "title": "Read The Objective-C Programming Language",
          "uri": "http://developer.apple.com/library/mac/#documentation/Cocoa/Conceptual/ObjectiveC/Introduction/introObjectiveC.html"
        },
        {
          "title": "Read About Memory Management",
          "uri": "https://developer.apple.com/library/mac/#documentation/Cocoa/Conceptual/MemoryMgmt/Articles/MemoryMgmt.html"
        },
        {
          "title": "Read chapters 6 - 15, 17 - 19, 24, 28 - 30 of Cocoa Design Patterns",
          "uri": "http://amzn.to/cocoa-design-patterns"
        },
        {
          "title": "Read and hack on sample code",
          "uri": "https://developer.apple.com/library/ios/navigation/#section=Resource%20Types&topic=Sample%20Code"
        },
        {
          "title": "Read the Mobile Human Interface Guidelines",
          "uri": "http://developer.apple.com/library/ios/#documentation/UserExperience/Conceptual/MobileHIG/Introduction/Introduction.html"
        }
      ],
      "validations": [
        "Use Xcode (and the built-in Interface Builder) to compile an iOS app.",
        "Describe and use ARC and MRC for memory mangement, as well as the rules of the retain/release/autorelease cycle.",
        "Use the basic data types (NSInteger, NSString), collection objects (NSArray, NSDictionary), and know when to use them instead of C primitives (int, char, etc).",
        "Understand the difference between using the mutable (NSMutableArray, NSMutableDictionary, NSMutableString) and immutable objects in Objective-C, their advantages and disadvantages.",
        "Use the basic display and navigation elements (UIWindow, UIView, UINavigationBar, UIToolbar, etc).",
        "Implement a solution using an UITableView, with navigation and a custom UITableViewCell.",
        "Implement the various iOS controls (UISwitch, UILabel, UISegmentedControl, etc).",
        "Understand and implement the usage of iPad specific UI controls, UIPopoverController and UISplitView.",
        "Design and use basic design patterns like MVC, delegates, callbacks, and notifications.",
        "Use CoreLocation to get location coordinates.",
        "Access the cameras to take pictures or access pictures from the device's photo gallery.",
        "Implement network communications using AFNetworking or NSUrlConnection.",
        "Implement UX and design best practices as prescribed by Apple.",
        "Meet App Store submission requirements and submit an app."
      ]
    },
    {
      "name": "Ongoing Reference",
      "resources": [
        {
          "title": "Maintain an active ADC account and refer to the official documentation",
          "uri": "https://developer.apple.com"
        },
        {
          "title": "Keep up-to-date on iOS news."
        },
        {
          "title": "Sign up for thecocoa-dev",
          "uri": "https://lists.apple.com/mailman/listinfo/cocoa-dev"
        }
      ],
      "validations": [
        "Create and manage Core Data objects and schemas.",
        "Decide when to best use:\n  * A category vs subclassing.\n  * Singletons.\n  * Delegates.\n  * Proxies.\n  * Closures.",
        "Implement animations using CoreAnimation and optimize drawing using CoreGraphics.",
        "Implement a multi-tasking environment free of race conditions (using appropriate locking techniques such as mutexes and semaphores, message passing, etc)",
        "Implement task driven concurrency using the Grand Central Dispatch (GCD) (http://developer.apple.com/library/ios/#documentation/Performance/Reference/GCD_libdispatch_Ref/Reference/reference.html) framework.",
        "Design and use APIs that prefer the use of closures instead of selectors and delegates.",
        "Create and use UIStoryboards to define and organize the application flow and transitions between screens.",
        "Debug memory leaks using NSZombieEnabled, Instruments, and other tools.",
        "Use CocoaPods (https://github.com/CocoaPods/CocoaPods) to define your project's dependencies.",
        "Create an universal app that contains code for both the iPhone/iPod and iPad devices."
      ]
    }
  ]
}
